app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "posts".* FROM "posts" LIMIT $1  [["LIMIT", 11]]
---
  def index
    if params[:limit]
      @posts = []
      limit = params[:limit].to_i
      @posts = Post.take(limit)
      render 'api/posts/index'
    else
      @posts = Post.all

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "fsadsad"], ["created_at", "2022-10-18 15:59:18.432360"], ["updated_at", "2022-10-18 15:59:18.432360"], ["user_id", 2]]
SELECT "posts".* FROM "posts"
---
  def create
    @post = Post.new(post_params)
    if @post.save
      @posts = Post.all