app/controllers/api/users_controller.rb

    def create
      @user = User.new(create_params)
      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "first_name", "last_name", "day", "month", "year", "gender", "bio", "featured", "location", "education", "work", "relationship", "phone_number", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"

    def update
      @user = User.find(params[:id])
      update = @user.update!(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "work" = $1, "created_at" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["work", "i love merica"], ["created_at", "2022-10-17 21:18:10.022000"], ["updated_at", "2022-10-17 21:20:01.353106"], ["id", 4]]